cases/chpt5-tubeBatch-275/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11200;
        startFace       10972;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       22172;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       22372;
    }
    side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          26;
        startFace       22572;
    }
    btm_side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       22598;
    }
)

// ************************************************************************* //
