cases/chpt5-tubeBatch-275/0/coreRegion.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.Phase1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    btm
    {
        type            zeroGradient;
    }
    side1Andside2Andside3
    {
        type            zeroGradient;
    }
    top_side1Andside2Andside3
    {
        type            zeroGradient;
    }
    btm_side1Andside2Andside3
    {
        type            zeroGradient;
    }
}
